In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'ID'        :['100',     '101',    '102',    '103',      '104',   '106',    '108',    '110',    '111',      '113'],
            'City'      :['Tokyo',   'Osaka',  'Kyoto',  'Hokkaido', 'Tokyo', 'Tokyo',  'Osaka',  'Kyoto',  'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,     1992,     1997,       1982,    1991,     1988,     1990,     1995,       1981],
            'Name'      :['Hiroshi', 'Akiki',  'Yuki',   'Satoru',   'Steve', 'Mituru', 'Aoi',    'Tarou',  'Suguru',   'Mitsuo'],
            'Region'    :['Kanto',   'Kansai', 'Kansai', 'Hokkaido', 'Kanto', 'Kanto',  'Kansai', 'Kansai', 'Hokkaido', 'Kanto']}
table = pd.DataFrame(data=raw_data)
table

    ID      City  Birth_year     Name    Region
0  100     Tokyo        1990  Hiroshi     Kanto
1  101     Osaka        1989    Akiki    Kansai
2  102     Kyoto        1992     Yuki    Kansai
3  103  Hokkaido        1997   Satoru  Hokkaido
4  104     Tokyo        1982    Steve     Kanto
5  106     Tokyo        1991   Mituru     Kanto
6  108     Osaka        1988      Aoi    Kansai
7  110     Kyoto        1990    Tarou    Kansai
8  111  Hokkaido        1995   Suguru  Hokkaido
9  113     Tokyo        1981   Mitsuo     Kanto

### 單基準

In [3]:
table.groupby('City')

In [4]:
table.groupby('City').groups

{'Hokkaido': [3, 8], 'Kyoto': [2, 7], 'Osaka': [1, 6], 'Tokyo': [0, 4, 5, 9]}

In [5]:
table.groupby('City').size()

City
Hokkaido    2
Kyoto       2
Osaka       2
Tokyo       4
dtype: int64

In [6]:
table.groupby('City')['Birth_year'].mean()

City
Hokkaido    1996.0
Kyoto       1991.0
Osaka       1988.5
Tokyo       1986.0
Name: Birth_year, dtype: float64

### 多基準

In [7]:
table.groupby(['Region', 'City'])

In [8]:
table.groupby(['Region', 'City']).groups

{('Hokkaido', 'Hokkaido'): [3, 8], ('Kansai', 'Kyoto'): [2, 7], ('Kansai', 'Osaka'): [1, 6], ('Kanto', 'Tokyo'): [0, 4, 5, 9]}

In [9]:
table.groupby(['Region', 'City']).size()

Region    City
Hokkaido  Hokkaido    2
Kansai    Kyoto       2
          Osaka       2
Kanto     Tokyo       4
dtype: int64

In [10]:
table.groupby(['Region', 'City'])['Birth_year'].mean()

Region    City
Hokkaido  Hokkaido    1996.0
Kansai    Kyoto       1991.0
          Osaka       1988.5
Kanto     Tokyo       1986.0
Name: Birth_year, dtype: float64

In [11]:
table.groupby(['Region', 'City'], as_index=False)['Birth_year'].mean()

     Region      City  Birth_year
0  Hokkaido  Hokkaido      1996.0
1    Kansai     Kyoto      1991.0
2    Kansai     Osaka      1988.5
3     Kanto     Tokyo      1986.0

### 迴圈

In [12]:
for group, content in table.groupby('Region'):
    print('='*20)
    print('Region name:{0}'.format(group))
    print(content)

====================
Region name:Hokkaido
    ID      City  Birth_year    Name    Region
3  103  Hokkaido        1997  Satoru  Hokkaido
8  111  Hokkaido        1995  Suguru  Hokkaido
====================
Region name:Kansai
    ID   City  Birth_year   Name  Region
1  101  Osaka        1989  Akiki  Kansai
2  102  Kyoto        1992   Yuki  Kansai
6  108  Osaka        1988    Aoi  Kansai
7  110  Kyoto        1990  Tarou  Kansai
====================
Region name:Kanto
    ID   City  Birth_year     Name Region
0  100  Tokyo        1990  Hiroshi  Kanto
4  104  Tokyo        1982    Steve  Kanto
5  106  Tokyo        1991   Mituru  Kanto
9  113  Tokyo        1981   Mitsuo  Kanto